[
    {
        "title": "MVP Email Processing System Development",
        "price": "$500.00",
        "body": "Build an MVP email processing system that reads emails, stores them in a database, and uses prompt engineering with a RAG engine to categorize emails into three buckets: informational, actionable, or marketing. Some emails will have draft replies automatically generated.\n\nProject Steps\n1. Set up an AWS-based backend to fetch and process emails.\n2. Use FastAPI to build a REST API for email processing and database interactions.\n3. Store email data (e.g., sender, recipients, content, attachments) in an RDS database.\n4. Implement a simple RAG pipeline to categorize emails into three buckets: informational, actionable, or marketing.\n5. Use prompt engineering to assist in sorting and generating draft replies for actionable emails.",
        "link": "https://www.upwork.com/jobs/MVP-Email-Processing-System-Development_~021873834480966308863/?referrer_url_path=/nx/search/jobs/",
        "timeAgo": "a minute ago",
        "type": "JAVASCRIPT",
        "time": "2024-12-30T20:52:24.746Z"
    },
    {
        "title": "Help Me Set Up a Basic SaaS Multi-Tenancy Structure with Supabase&React",
        "price": "$100.00",
        "body": "I'm looking for an expert to help set up the foundational structure for a SaaS multi-tenancy application using Loveable.dev and Supabase.\n\nHere’s what I need:\n\n-Classic multi-tenancy with data isolation.\n-A tenant is a \"team\" with members assigned different roles (e.g., admin, member).\n-Initial setup with proper RLS policies for tenant isolation.\n\n*This is just the base setup to get me started for learning purposes, and I’ll carry on from here.\n\nI’ll provide a boilerplate and detailed information to help you get started upon DM. If you’re experienced with multi-tenancy and Supabase, especially with RLS, let’s connect!",
        "link": "https://www.upwork.com/jobs/Help-Set-Basic-SaaS-Multi-Tenancy-Structure-with-Supabase-React_~021873831786604062606/?referrer_url_path=/nx/search/jobs/",
        "timeAgo": "11 minutes ago",
        "type": "JAVASCRIPT",
        "time": "2024-12-30T20:42:24.748Z"
    },
    {
        "title": "Recreate some online Javascript Tools For Our Website",
        "price": "1 to 3 months, Less than 30 hrs/week",
        "body": "We are in need of recreating a few javascript based tools onto our wordpress website. \n\nThese tools will be offered to our membership portal. \n\nThe scope of the tools is very defined, and we have direct examples that can be used to create the tools. \n\nAs far as implementation - I would like to write all of the code for said tools within a wordpress plugin - so that we can keep all of our functionalities updated as we develop upgrades and versions to the tools. \n\nFor the front-facing interfaces, we would create simple CSS styled page layouts using Wordpress Elementor and old school css. The majority of users would be accessing these tools through a mobile device - but we SHOULD be able to handle that utilizing Elementor's responsive capabilities.",
        "link": "https://www.upwork.com/jobs/Recreate-some-online-span-class-highlight-Javascript-span-Tools-For-Our-Website_~021873831032258488206/?referrer_url_path=/nx/search/jobs/",
        "timeAgo": "14 minutes ago",
        "type": "JAVASCRIPT",
        "time": "2024-12-30T20:39:24.749Z"
    },
    {
        "title": "Simple Onboarding Program Development",
        "price": "1 to 3 months, Less than 30 hrs/week",
        "body": "We are looking for a skilled professional to create an effective and streamlined onboarding program tailored for our organization. The goal is to ensure a smooth transition for new hires, enhancing their engagement and productivity from day one. The onboarding program should be simple yet comprehensive, covering essential topics and resources. If you have experience in employee training and onboarding processes, we would love to hear from you!",
        "link": "https://www.upwork.com/jobs/Simple-Onboarding-Program-Development_~021873830468828204436/?referrer_url_path=/nx/search/jobs/",
        "timeAgo": "17 minutes ago",
        "type": "JAVASCRIPT",
        "time": "2024-12-30T20:36:24.749Z"
    },
    {
        "title": "ReactFlow Developer for Interactive Frontend App",
        "price": "1 to 3 months, Less than 30 hrs/week",
        "body": "We are looking for an experienced ReactFlow developer to create an interactive frontend application. The ideal candidate will possess a strong understanding of ReactFlow and its capabilities to design and implement dynamic user interfaces. You will collaborate with me to build this interface. Familiarity with modern frontend technologies and best practices is essential. If you are passionate about building interactive applications and have a proven track record with ReactFlow, we would love to hear from you. Figma file will be provided.",
        "link": "https://www.upwork.com/jobs/ReactFlow-Developer-for-Interactive-Frontend-App_~021873830173712709251/?referrer_url_path=/nx/search/jobs/",
        "timeAgo": "18 minutes ago",
        "type": "JAVASCRIPT",
        "time": "2024-12-30T20:35:24.749Z"
    },
    {
        "title": "Node.js and React Translation Expert Needed for Deployment",
        "price": "1 to 3 months, Less than 30 hrs/week",
        "body": "We are seeking an experienced developer to assist with translating a fully functional Node.js application into a React-based deployment. The ideal candidate will have a strong understanding of both Node.js and React, with the ability to ensure smooth integration and functionality across platforms. Your expertise will be crucial in maintaining the integrity of the application's performance during this transition. If you have a passion for coding and a proven track record in deploying applications successfully, we want to hear from you!\n\nThis is a reservation type system and is currently relatively simple, containing ~6 modules and ~5 data tables",
        "link": "https://www.upwork.com/jobs/Node-and-React-Translation-Expert-Needed-for-Deployment_~021873827999972789652/?referrer_url_path=/nx/search/jobs/",
        "timeAgo": "26 minutes ago",
        "type": "JAVASCRIPT",
        "time": "2024-12-30T20:27:24.749Z"
    },
    {
        "title": "Bubble.io Developer Needed",
        "price": "$500.00",
        "body": "We’re looking for a skilled Bubble.io Developer to build a web application that allows authorized users to publish new content—either as a post or a page—to one or more WordPress sites. This application will feature a secure login screen, easy-to-use data fields for creating content (body, title, excerpt, slug), the option to upload a featured image, choose a parent page if necessary, and the ability to choose between different Wordpress sites, \n\nResponsibilities\nDesign & Development\nBuild a secure login system in Bubble.io requiring email and password to ensure only authorized users can access the app.\nDevelop front-end pages in Bubble.io that collect post/page details: body content, title, excerpt, slug, and featured image.\nWordPress Integration\nImplement functionality to publish the created content as either a WordPress post or a WordPress page.\nInclude the ability to set a featured image for each post/page.\nInclude the ability to select parent pages for new pages when needed.\nSet up a drop-down list of multiple WordPress sites that users can select from.\nEnsure the system allows easy addition of new WordPress sites in the future.\nSecurity & Scalability\nImplement secure authentication to protect user data.\nEnsure the application is scalable and can support additional features as needed.\nCreate clear technical documentation for the Bubble.io workflows, the WordPress integration process, and instructions for adding additional sites.\n\n\nIf you’re excited to build a user-friendly Bubble.io application that publishes seamlessly to WordPress, we’d love to hear from you! \nPlease send the following\nThe name of your favorite author\nYour resume or CV.\nLinks or screenshots of relevant Bubble.io projects.\nA brief description of your experience working with WordPress APIs (if applicable).",
        "link": "https://www.upwork.com/jobs/Bubble-Developer-Needed_~021873827575921382399/?referrer_url_path=/nx/search/jobs/",
        "timeAgo": "28 minutes ago",
        "type": "JAVASCRIPT",
        "time": "2024-12-30T20:25:24.749Z"
    },
    {
        "title": "Webflow Developer Needed for Pixel Perfect Frontend & Tracking Integration",
        "price": "1 to 3 months, Hours to be determined",
        "body": "We're seeking an experienced Webflow developer who excels in creating pixel-perfect front-end designs. The ideal candidate should have a strong background in implementing tracking pixels and handling backend tasks. You will be responsible for translating design concepts into responsive and visually stunning Webflow sites. An attention to detail and proficiency in both front-end and backend aspects are crucial for this role. If you are passionate about delivering high-quality work and have a track record of successful projects, we'd love to hear from you!",
        "link": "https://www.upwork.com/jobs/Webflow-Developer-Needed-for-Pixel-Perfect-Frontend-Tracking-Integration_~021873826503981993364/?referrer_url_path=/nx/search/jobs/",
        "timeAgo": "32 minutes ago",
        "type": "JAVASCRIPT",
        "time": "2024-12-30T20:21:24.750Z"
    },
    {
        "title": "Got Myself Into a Jam with Framer",
        "price": "Less than 1 month, Less than 30 hrs/week",
        "body": "I need help finishing my framer website. I hired someone in Nigeria through Fiverr who I do not think knows what he is doing and I need someone to finish it. I have the artwork. It is beautiful. It is about a film ending domestic violence.\n\nThe website is full bleed, parallax, scrollstop. Are you familiar with these? \n\nThank you.",
        "link": "https://www.upwork.com/jobs/Got-Myself-Into-Jam-with-Framer_~021873826335938242446/?referrer_url_path=/nx/search/jobs/",
        "timeAgo": "33 minutes ago",
        "type": "JAVASCRIPT",
        "time": "2024-12-30T20:20:24.750Z"
    },
    {
        "title": "Website",
        "price": "Less than 1 month, Less than 30 hrs/week",
        "body": "Looking to build a simple informative website 5 pages tops, maintenance and service industry.",
        "link": "https://www.upwork.com/jobs/Website_~021873825864431440895/?referrer_url_path=/nx/search/jobs/",
        "timeAgo": "35 minutes ago",
        "type": "JAVASCRIPT",
        "time": "2024-12-30T20:18:24.750Z"
    }
]